1.1 列出至少有两个员工的部门。 
1.2 查询工资大于或者等于2000 的员工信息 
1.3 查询至少有两个员工的工资不低于2000的部门编号  
2.1 列出薪金比“SMITH”多的所有员工。 
2.2 查询工资 与 SCOTT 相同的员工信息
2.3 查询工资 与 SCOTT 相同的员工信息,并且不返回SCOTT自己的信息
3．列出所有员工的姓名及其直接上级的姓名。 
4．列出受雇日期早于其直接上级的所有员工。 
5．列出部门名称和这些部门的员工信息，同时列出那些没有员工的部门。 
6．列出所有“CLERK”（办事员）的姓名及其部门名称。
7．列出最低薪金大于1500的各种工作。 
8．列出在部门“SALES”（销售部）工作的员工的姓名，假定不知道销售部的部门编号。 
9．列出薪金高于公司平均薪金的所有员工。 
10．列出与“SCOTT”从事相同工作的所有员工。 
11．列出薪金等于部门30中员工的薪金的非30号部门的员工的姓名和薪金。 
12．列出薪金高于在部门30工作的所有员工的薪金的员工姓名和薪金。 
13．列出在每个部门工作的员工数量、平均工资和平均服务期限。 
14．列出所有员工的姓名、部门名称和工资。 
15．列出所有部门的详细信息和部门人数。 
16．列出各种工作的最低工资。 
17．列出各个部门的MANAGER（经理）的最低薪金。 
18．列出所有员工的年工资,按年薪从低到高排序。
19.查出emp表中薪水在3000以上（包括3000）的所有员工的员工号、姓名、薪水。
20.查询出所有薪水在’ALLEN’之上的所有人员信息。
21.查询出emp表中部门编号为20，薪水在2000以上（不包括2000）的所有员工，显示他们的员工号，姓名以及薪水，以如下列名显示：员工编号 员工名字 薪水
22.查询出emp表中所有的工作种类（无重复）
23.查询出所有奖金（comm）字段不为空的人员的所有信息。
24.查询出薪水在800到2500之间（闭区间）所有员工的信息。（注：使用两种方式实现and以及between and）
25.查询出员工号为7521，7900，7782的所有员工的信息。（注：使用两种方式实现，or以及in）
26.查询出名字中有“A”字符，并且薪水在1000以上（不包括1000）的所有员工信息。
27.查询出名字第三个字母是“M”的所有员工信息。
28.将所有员工按薪水升序排序，薪水相同的按照入职时间降序排序。
29.将所有员工按照名字首字母升序排序，首字母相同的按照薪水降序排序。
30.查询出最早工作的那个人的名字、入职时间和薪水。
31.显示所有员工的名字、薪水、奖金，如果没有奖金，暂时显示100.
32.显示出薪水最高人的职位。
33.查出emp表中所有部门的最高薪水和最低薪水，部门编号为10的部门不显示。
34.删除10号部门薪水最高的员工。
35.将薪水最高的员工的薪水降30%。
36.查询员工姓名，工资和 工资级别(工资>=3000 为3级，工资>2000 为2级，工资<=2000 为1级)



