
-----------------------------LINUX常用命令-------------------------------

1.查看当前路径

2.查看当前路径下面有哪些文件或文件夹

4.进入home路径

5.返回上一级

5.返回默认进入路径

6.清屏

7.切换用户为root

8.新建文件夹
(1)在home目录下新建一个abc文件夹名
(2)在abc中创建一个子文件夹efg

9.创建文件abc.txt文件在home目录中

10.用vim编辑一个mytask1.sh文件

11.查看文件

13.将aaa.txt复制到bbb文件夹中（没有bbb就创建一个）

14.删除mytask1.sh文件

19.查找名为aaa.txt的文件

22.查看ip

23.查看磁盘占用情况

24.设置脚本定时
（1）每分钟调把ls -l追加写入to.txt

25.查看定时任务
（1）查看定时任务
（2）删除定时任务

24.将文件覆盖或追加写入
（1）将ll查出来的内容写入到a.txt中，如果已经有a.txt则覆盖写入
（2）将ll查出来的内容写入到a.txt中，如果已经有a.txt则追加写入

25、显示当前日期
（1）以日历的方式显示时间
（2）显示当前所在的年月日明细数据
（3）按照"+%Y-%m-%d"固定的日期格式显示时间

26、查看操作的历史记录

27、修改权限

28、查看网络情况
（1）查看网络情况
（2）停止ping

------------------------------------定时调度------------------------------------

定时调度：创建一个定时调度任务，每隔一分钟，将当前的日期信息，追加到/tmp/mydate文件中


















































