1 分数表
插入数据如下,第一行为表字段（列）
+----+------+---------+-------+-------+
| id | name | subject | score | clas |
+----+------+---------+-------+-------+
|  1 | 张三 | chinese |  60.5 | 901  |
|  1 | 张三 | english |  40.5 | 901  |
|  1 | 张三 | math    |  90.5 | 901  |
|  2 | 王五 | chinese |    78 | 901  |
|  2 | 王五 | english |  80.5 | 901  |
|  3 | 李四 | chinese |    30 | 902  |
|  3 | 李四 | english |    90 | 902  |
|  4 | 萝卜 | chinese |    50 | 903  |
+----+------+---------+-------+-------+


要求：
	1）、创建表和输入数据
	2）、删除clas列


2 课程表
   课程号 
   课程名称  
   老师编号 
    
表数据
 ('3-105' ,'计算机导论',825)
 ('3-245' ,'操作系统' ,804);
 ('6-166' ,'数据电路' ,856);
 ('9-888' ,'高等数学' ,100);

 要求：
	1）、创建表和输入数据
	2）、把'老师编号'数据类型改为NUMBER(4)


3 成绩表
   学号      
   课程号     
   分数       

表数据
 (103,'3-245',86);
 (105,'3-245',75);
 (109,'3-245',68);
 (103,'3-105',52);
 (105,'3-105',88);
 (109,'3-105',76);
 (101,'3-105',64);
 (107,'3-105',91);
 (108,'3-105',58);
 (101,'6-166',85);
 (107,'6-106',79);
 (108,'6-166',81);
 
 要求：
	1）、创建表和输入数据
	2）、删除表中分数小于60的行


4 老师表
    老师编号 
    老师名字 
    性别    
    职称   
    部门   
 

 表数据
(804,'李诚','男','副教授','计算机系');
(856,'张旭','男','讲师','电子工程系');
(825,'王萍','女','助教','计算机系');
(831,'刘冰','女','助教','电子工程系');

要求：
	1）、创建表和输入数据
	2）、把'刘冰'老师的职称改为'讲师'


